{
  "backend/main.mo": "Implements message storage with create, list, delete-after-5-minutes, and trimming logic, enforcing limits and timestamps.",
  "feature_evidence.json": "Lists features, related files, components, and test IDs for tracking implementation evidence.",
  "frontend-file-summaries.txt": "Provides short predefined summaries for key frontend chat-related files.",
  "frontend/index.css": "Defines global Tailwind base styles and a warm neutral color theme for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app layout with header, themed image, message feed, composer, and footer.",
  "frontend/src/chat/backendClient.ts": "Wraps actor methods to send, list, and delete messages with initialization checks.",
  "frontend/src/chat/components/MessageComposer.tsx": "Textarea-based message input enforcing a 150‑char limit and sending via mutation with UI feedback.",
  "frontend/src/chat/components/MessageFeed.tsx": "Loads and displays messages with loading, error, and empty states including generated imagery.",
  "frontend/src/chat/components/MessageItem.tsx": "Shows a single message with timestamp, countdown to deletability, and a delete confirmation flow.",
  "frontend/src/chat/queries.ts": "React Query hooks for polling messages and managing send/delete mutations with cache invalidation.",
  "frontend/src/chat/time.ts": "Utility functions converting nanosecond timestamps to dates, checking message age, delete eligibility, and producing display-friendly timestamps.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to the current Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, logout, and exposing identity status through a provider and hook.",
  "frontend/src/index.css": "Tailwind base styles defining a warm neutral theme with extensive OKLCH variables and dark mode overrides.",
  "frontend/src/main.tsx": "React entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom OKLCH theme colors, typography, animations, and container settings.",
  "project_state.json": "Project state metadata describing features, requirements, and generated image assets for the anonymous chat app."
}